In [3]:
import numpy as np
import pandas as pd

In [4]:
studentsDf = pd.read_csv('students.csv')
studentsDf.head()

   StudentID            Name   Age Grade             Major
0     1001.0        John Doe  20.0     A  Computer Science
1     1002.0      Jane Smith  22.0     B           Biology
2     1003.0     Emily Davis  21.0     A       Mathematics
3     1004.0   Michael Brown  23.0     C           History
4     1005.0  Jessica Wilson  20.0     B           Physics

In [3]:
studentsDf.loc[:, str()] = str()

In [4]:
studentsDf.head()

   StudentID            Name   Age Grade             Major
0     1001.0        John Doe  20.0     A  Computer Science
1     1002.0      Jane Smith  22.0     B           Biology
2     1003.0     Emily Davis  21.0     A       Mathematics
3     1004.0   Michael Brown  23.0     C           History
4     1005.0  Jessica Wilson  20.0     B           Physics

In [5]:
studentsDf.drop(str(), axis=1, inplace=True)

In [6]:
studentsDf.columns

Index(['StudentID', 'Name', 'Age', 'Grade', 'Major'], dtype='object')

In [7]:
studentsDf.loc[:, f'col. {len(studentsDf.columns)}'] = None

In [8]:
studentsDf.head()

   StudentID            Name   Age Grade             Major col. 5
0     1001.0        John Doe  20.0     A  Computer Science   None
1     1002.0      Jane Smith  22.0     B           Biology   None
2     1003.0     Emily Davis  21.0     A       Mathematics   None
3     1004.0   Michael Brown  23.0     C           History   None
4     1005.0  Jessica Wilson  20.0     B           Physics   None

In [9]:
studentsDf.drop('col. 5', axis=1, inplace=True)

In [10]:
studentsDf.head()

   StudentID            Name   Age Grade             Major
0     1001.0        John Doe  20.0     A  Computer Science
1     1002.0      Jane Smith  22.0     B           Biology
2     1003.0     Emily Davis  21.0     A       Mathematics
3     1004.0   Michael Brown  23.0     C           History
4     1005.0  Jessica Wilson  20.0     B           Physics

In [11]:
studentsDf.loc[0]

StudentID              1001.0
Name                 John Doe
Age                      20.0
Grade                       A
Major        Computer Science
Name: 0, dtype: object

In [12]:
studentsDf.loc[[0]]

   StudentID      Name   Age Grade             Major
0     1001.0  John Doe  20.0     A  Computer Science

In [13]:
# studentsDf.loc[0] = [1001.10, 'Jhonny', 20.1, 'A', 'Pre-Engeineering']
studentsDf.loc[[0]] = [1001.10, 'Jhonny', 20.1, 'A+', 'Pre-Engeineering']

In [15]:
# studentsDf.loc[0, 'Name'] = 'Jhon-Doe'
# studentsDf.loc[[0], ['Name']] = 'Jhon-Doe'
'float' in str(studentsDf.loc[:, ['StudentID']].dtypes['StudentID'])

True

In [15]:
studentsDf.head()

   StudentID            Name   Age Grade             Major
0     1001.1          Jhonny  20.1    A+  Pre-Engeineering
1     1002.0      Jane Smith  22.0     B           Biology
2     1003.0     Emily Davis  21.0     A       Mathematics
3     1004.0   Michael Brown  23.0     C           History
4     1005.0  Jessica Wilson  20.0     B           Physics

In [16]:
studentsDf.loc[0, ['Name']]

Name    Jhonny
Name: 0, dtype: object

In [17]:
# studentsDf.loc[:, ['Name', 'Age']]
studentsDf.loc[[0, 1, 2, 3, 4], ['Name', 'Age']]

             Name   Age
0          Jhonny  20.1
1      Jane Smith  22.0
2     Emily Davis  21.0
3   Michael Brown  23.0
4  Jessica Wilson  20.0

In [18]:
studentsDf[['Name']]

                Name
0             Jhonny
1         Jane Smith
2        Emily Davis
3      Michael Brown
4     Jessica Wilson
..               ...
57      Marie Brooks
58      Eugene Kelly
59  Victoria Sanders
60            Faisal
61              Faiq

[62 rows x 1 columns]

In [19]:
studentsDf.iloc[[0]]

   StudentID    Name   Age Grade             Major
0     1001.1  Jhonny  20.1    A+  Pre-Engeineering

In [20]:
pd.DataFrame().to_csv('csv_file.csv')

In [21]:
import os
a = os.system('powershell -Command "mode con.GetType"')
a

1

In [22]:
commands = [
    ("load <filename>", "Load a CSV file."),
    ("load <dirname>", "Load a directory."),
    ("load <data>", "Load data."),
]
for user_cmd, description in enumerate(commands):
    print(f"{user_cmd} - {description}")

0 - ('load <filename>', 'Load a CSV file.')
1 - ('load <dirname>', 'Load a directory.')
2 - ('load <data>', 'Load data.')

In [23]:
'exit' in ['exit', 'enter']

True

In [24]:
'hi'+'.csv'

'hi.csv'

In [25]:
a = input('Enter')
a

''

In [26]:
0 == False

True

In [27]:
for i in range(5):
    print(i)

0
1
2
3
4

In [28]:
def fname(bool_):
    if bool_:
        return fname(False)
    else:
        return 1


a = fname(True)

In [29]:
a

1

In [30]:
studentsDf.columns[0]

'StudentID'

In [31]:
studentsDf.iloc[[0]].columns

Index(['StudentID', 'Name', 'Age', 'Grade', 'Major'], dtype='object')

In [1]:
float('122')

122.0

In [20]:
from pynput import keyboard
import time

In [27]:
# Initializing keboard listner
keyboard_listner = keyboard.Listener(
    on_press=lambda key: print(key.name == 'shift'))
# Start to lisening
keyboard_listner.start()

time.sleep(5)

keyboard_listner.stop()

True
True
True
True
True
False

In [39]:
from utils import is_convertible_to_int
values_to_set_in_row = ['1', '2', '3', '4', '5']
temp_values = []
for value in values_to_set_in_row:
    if is_convertible_to_int(value):
        value = int(value)
    temp_values.append(value)
else:
    print(temp_values)
    values_to_set_in_row = temp_values

values_to_set_in_row

[1, 2, 3, 4, 5]

[1, 2, 3, 4, 5]

In [38]:
values_to_set_in_row

[5]